[
  {
    "id": 2,
    "Title": "University Manager",
    "git": "https://github.com/rabeeh003/university-frontend",
    "live": "https://juniorcollege.vercel.app/",
    "description": "This project under construction. this increases the efficiency of the administration and colleges from entrance to finel exams.",
    "image": "/product/juniar-college.png",
    "thambnail": "/thumbnail/juniar-college.png",
    "story": "This project is under construction. When I was studying at my college, I noticed the system was not efficient and not computerized, so I decided to make this app to increase the efficiency of the administration and colleges, from entrance to final exams. The administration can manage colleges, departments, syllabuses, exams, entrance processes, and results. Colleges can manage students and teachers. Teachers can manage their attendance and marks. Students can view their grades and results.",
    "fechers": [
      "4 user sections (Admin, College, Teacher, Student)",
      "implement a barcode system for exams. its help to fast and sequre result publishing",
      "Admin management of colleges, students, exams, entrance, and results",
      "College management of students, and teachers",
      "selected teachers only the access for adding exam results"
    ],
    "skills": [
      "Next.js",
      "TypeScript",
      "Django",
      "PostgreSQL",
      "Redux",
      "RestAPI",
      "JWT",
      "Git",
      "Tailwind",
      "NextUI",
      "Framer-motion",
      "Jodit editor",
      "Themes",
      "Axios"
    ]
  },
  {
    "id": 4,
    "Title": "Hotler",
    "description": "Order management system for cafes, messes, hotels, and restaurants with QR ordering. this project is still in final development.",
    "git": "https://github.com/rabeeh003/Hotler/",
    "live": "https://hotler.vercel.app/",
    "image": "/product/hotler.png",
    "thambnail": "/thumbnail/hotler.png",
    "story": "This project is still in its final development stage, and I'm collaborating on the backend with my friend. It aims to implement a QR ordering system for customers without requiring authentication, targeting cafes, messes, hotels, restaurants, and other businesses. The system will generate QR codes for customers to place orders, track order status, and ensure the food is delivered to the customer.",
    "fechers": [
      "QR ordering system without customer authentication",
      "Subscription for this product",
      "Framer motion for frontend animation"
    ],
    "skills": [
      "Next.js",
      "NextUI",
      "Framer-motion",
      "Firebase Storage",
      "Google Maps",
      "Chart.js",
      "Next-auth",
      "Next-themes"
    ]
  },
  {
    "id": 3,
    "Title": "Modapps.in",
    "description": "A freelance project as a website for posting blogs and apps.",
    "live": "https://modapps.in/",
    "image": "/product/modapps.png",
    "thambnail": "/thumbnail/modapps.png",
    "story": "This is a freelance project. It's a website for posting blogs and apps, with integrated Google Analytics for traffic analysis and Google Ads. This project is for a tech YouTuber and enhances user experience with NextUI and Framer Motion.",
    "fechers": [
      "Admin management of apps and blogs",
      "Google Analytics and ads integration",
      "NextUI and Framer motion for enhanced user experience",
      "Hosted on AWS"
    ],
    "skills": [
      "React Vite",
      "Django",
      "PostgreSQL",
      "Redux",
      "RestAPI",
      "JWT",
      "Google Analytics",
      "AWS",
      "Gunicorn",
      "Git",
      "Tailwind",
      "NextUI",
      "Framer-motion",
      "Jodit editor",
      "Themes",
      "Axios"
    ]
  },
  {
    "id": 1,
    "Title": "Nearshop.online",
    "git": "https://github.com/rabeeh003/nearshop",
    "live": "https://nearshop.online/",
    "description": "Multi-vendor eCommerce app connecting shops and customers with inventory management, billing, and payment management.",
    "image": "/product/nearshop.png",
    "thambnail": "/thumbnail/nearshop.png",
    "story": "A platform for retail shops to connect with customers, featuring billing management and multi-shop ownership. Integrated Google Maps for location-based services. shop can manage inventory, orders and billing, customers can order products, and owners can manage shops. shops and owncer can analize the their sales and customers' orders.",
    "fechers": [
      "3 types of users (customers, shoppers, owners).",
      "4 types of authentication methods.",
      "Google Maps integration.",
      "Billing and payment management.",
      "Global product concept to reduce duplicate entries.",
      "Progressive Web App (PWA)."
    ],
    "skills": [
      "React",
      "Django",
      "PostgreSQL",
      "RestAPI",
      "JWT",
      "Google Maps",
      "Firebase",
      "AWS",
      "Gunicorn",
      "Git",
      "Bootstrap",
      "Phone OTP Auth",
      "Razorpay",
      "Figma"
    ]
  },
  {
    "id": 5,
    "Title": "Metrix Game",
    "description": "1024 game with custom algorithm for calculation and alignment.",
    "git": "https://github.com/rabeeh003/1024/",
    "live": "https://1024-game.vercel.app/",
    "image": "/product/1024.png",
    "thambnail": "/thumbnail/1024.png",
    "story": "Developed the 1024 game with a custom algorithm for metrix calculation and alignment. Used NPM modules for swipe tracking and music playback.",
    "fechers": [
      "Custom algorithm for metrix calculation",
      "Swipe tracking",
      "Music playback"
    ],
    "skills": [
      "React Vite",
      "React-swipeable",
      "Metrix",
      "React-howler"
    ]
  },
  {
    "id": 6,
    "Title": "OLX - Redesign",
    "description": "Redesign of the OLX website with a modern look.",
    "git": "https://github.com/rabeeh003/OLX",
    "live": "https://olx-delta.vercel.app/",
    "image": "/product/olx.png",
    "thambnail": "/thumbnail/olx.png",
    "story": "When I visited the OLX website, I noticed that the UI was outdated and the site wasn't responsive. So, I decided to redesign the website with a modern look and feel. I created a new design for the home page and other pages. It was a great experience for me.",
    "fechers": [
      "Modern UI design",
      "Firebase for authentication and data storage"
    ],
    "skills": [
      "React Vite",
      "Firebase",
      "Axios",
      "Vercel"
    ]
  },
  {
    "id": 9,
    "Title": "Movie List",
    "description": "Movie list android app with TMDB API integration using React Native.",
    "git": "https://github.com/rabeeh003/MovieApp",
    "image": "/product/movieapp.png",
    "thambnail": "/thumbnail/movieapp.png",
    "story": "This application is a movie list app with TMDB API integration using React Native. It is a simple app that allows users to search for movies and view their details. It is a great way to learn React Native and TMDB API.",
    "fechers": [
      "TMDB api integration",
      "Clean design"
    ],
    "skills": [
      "React Native",
      "TMDB API",
      "Axios",
      "expo cli",
      "Yarn"
    ]
  },
  {
    "id": 7,
    "Title": "Hospi",
    "description": "A patients management ( token ) project using python django and django themplate.",
    "git": "https://github.com/rabeeh003/Hospi/",
    "image": "/product/hospi.png",
    "thambnail": "/thumbnail/hospi.png",
    "story": "Hospi is a small clinic doctor booking website developed with Django and Bootstrap. This project allows patients to book a slot with a doctor using their phone number, helping to save time. The clinic can easily manage tokens and patients. The website also provides additional features for managing the site, such as listing doctors and departments with the help of an admin panel.",
    "fechers": [
      "Book appointments with doctors using phone numbers",
      "Manage appointments, tokens, and patients efficiently",
      "List doctors and departments on the website",
      "Admin panel for managing website content and direct token booking"
    ],
    "skills": [
      "Django",
      "Bootstrap",
      "Django-admin",
      "html",
      "css",
      "js"
    ]
  },
  {
    "id": 8,
    "Title": "Al Misbah",
    "description": "Dua application for musslims.",
    "live": "https://rabeeh003.github.io/almisbah.com/",
    "image": "/product/almisbah.png",
    "thambnail": "/thumbnail/almisbah.png",
    "story": "When I was in college, my classmates and I published a dua (prayer) book. We later decided to make it accessible on mobile devices. Someone suggested saving it as a PDF and sharing it, but I explained the downside—anyone could download, sell, or modify it. I proposed creating an app instead, but my friends mocked the idea. After that day, I thought about how to create an application. This led me to Sketchware, a no-code Android app-building platform. I learned it, built a small mock application, and shared it with my friends. After a few updates, I completed the app with a neat look. This was my first step into the development field.",
    "fechers": [
      "Include google qibla finder",
      "App share option",
      "Include some Quran surahs",
      "Include fundamental duas, dhikr, counter, adan times and others"
    ],
    "skills": [
      "skechware",
      "picsart",
      "html",
      "css",
      "js",
      "photoshop"
    ]
  }
]